class Item {
  final String uml;
  final double price;
  final String name;
  final String details;
  final String type;

 
Item({required this.uml, required this.price, required this.name, required this.details, required this.type});

}


 

List<Item> items = [
  Item(
      uml: 'assets/1.png',
      price: 43.00,
      name: 'AUTHA',
      details: """
الوزن: 250gالوزن: 250g
المصدر: كولومبيا
المعالجة: مغسولة
الارتفاع: 1700 م
الايحاءات: حمضية ناعمة - سكريات بنيه - كراميل - حلاوة - قوام ممتلئ
التحضير: فلتر - اسبريسو""", type: 'كولومبيا اكسيلسو | Excelso'),


  Item(uml: 'assets/2.png', price: 34.99, name: 'GOTAH' ,details: """
الوزن: 250g
المصدر: كولومبيا
المعالجة: مغسولة
الارتفاع: 1700 م
الايحاءات: حمضية ناعمة - سكريات بنيه - كراميل - حلاوة - قوام ممتلئ
التحضير: فلتر - اسبريسو""", type: 'بلند قوته | Blend Gotah'),


  Item(uml: 'assets/3.png', price: 56.50, name: 'Tricycle',details: """الوزن: 250g
المصدر: البرازيل
السلالة: كاتواي - بوربون اصفر
الارتفاع: 900-1200 م
المعالجة: مجففة
الايحاءات: خوخ - كاكاو داكن - كريمي - مكسرات
التحضير: فلتر - اسبريسو""", type: 'برازيل موجيانا| Mogiana'),

  Item(uml: 'assets/4.png', price: 51.00, name: 'Nasj',details: """الوزن: 250g
المصدر: كولومبيا
السلالة: كاستيلو
الارتفاع: 1950-2100م
المعالجة: لا هوائية
الايحاءات: شوكلاتة داكنة - زهور - توت - تفاح احمر
التحضير: فلتر - اسبريسو""", type: 'كولومبيا مانوس  | Manos'),

  Item(uml: 'assets/5.png', price: 55.00,name: 'Ash',details: """الوزن: 250g
المصدر: كولومبيا
التقييم: 85.5
المعالجة: مغسولة
الإيحاءات: خوخ - جريب فروت - عنب أبيض
التحضير: فلتر - إسبريسو""", type: 'كولومبيا جينتيانا  | Gentiana'),


  Item(uml: 'assets/6.png', price: 57.60,name:"Suwaa" ,details: """
المصدر: البرازيل - السلفادور - اوغندا
المعالجة: مجففة - مغسولة
الايحاءات: مكسرات - شمام - كراميل - شوكولاتة بالحليب
التحضير: اسبريسو - مشروبات الحليب""", type: 'خليط اسبريسو | Espresso Blend'),


  Item(uml: 'assets/7.png', price: 49.96,name: "Slope",details: """الوزن: 250g
المصدر: البرازيل - الهندوراس - إثيوبيا
المعالجة: خليط
الإيحاءات: كراميل - شوكولاتة - حلاوة
التحضير: اسبريسو - مشروبات الحليب""", type: 'بلند V2 - سلوب | Blend V2'),


  Item(uml: 'assets/8.png', price: 60.00,name: "Kiffa",details: """الوزن: 250g
المصدر: إثيوبيا
المنطقة: قيدب
السلالة: هيرليوم
المعالجة: مجففة
الايحاءات: حلوة - إيحاء الأزهار - التوت - المشمش
التحضير: فلتر - اسبريسو""", type: 'اثيوبيا ووريدا | Woreda'),


  Item(uml: 'assets/9.png', price: 44.00,name: "Sout",details: """الوزن: 250g
المصدر: البرازيل
الارتفاع: 800-1110
المعالجة: مجففة
الايحاءات: فواكه - توابل - شوكلاتةة
التحضير: فلتر - اسبريسو""", type: 'برازيل ميندوزا | Mendoza'),


  Item(uml: 'assets/10.png', price: 37.00,name: "Roasting House",details: """الوزن: 227g
الارتفاع: 1900 م
المعالجة: مزيج
الايحاءات: رائحة زكية ومليئة بالكاكاو - قوام متوازن - غني وكريمي دون ان يكون عالي القوة والمرارة
التحضير: اسبريسو - مشروبات الحليب""", type: 'مزيج اسبريسو | TRH Espresso'),
];

  